# Запрашиваем у пользователя имя, первую букву имени делаем заглавной
input_name = input("Здравствуйте! На связи умный трекер FitLife."
                   " Как вас зовут? ")
user_name = input_name.capitalize()
# Приветствуем пользователя
print("\n" + user_name + ", рады вас приветствовать!")

# Запрашиваем у пользователя возраст, приводим к типу int.
# Проверяем на корректность вода - отрицательные значения, ноль и текст
while True:
    try:
        user_age = int(input("\nСколько вам лет? "))
        if user_age <= 0:
            print("Возраст не может быть отрицательным или равным нулю."
                  " Попробуйте ещё раз\n")
            continue
        break
    except ValueError:
        print("Введен некорректный возраст. Попробуйте ещё раз\n")

# Запрашиваем вес пользователя, приводим к типу float.
# Проверяем на корректность вода - отрицательные значения, ноль и текст
while True:
    try:
        user_weight = float(input("\nКакой у вас вес (кг)? "))
        if user_weight <= 0:
            print("Вес не может быть отрицательным или равным нулю."
                  " Попробуйте ещё раз\n")
            continue
        break
    except ValueError:
        print("Введен некорректный вес. Попробуйте ещё раз\n")

# Запрашиваем рост пользователя, приводим к типу float,
# даем подсказку, в каком виде писать.
# Проверяем на корректность вода - отрицательные значения,
# ноль, плавающая точка и текст
while True:
    try:
        user_height = float(input("\nКакой у вас рост (м)? "
                                  "/используете точку в вместо запятой/ "))
        if user_height <= 0:
            print("Рост не может быть отрицательным или равным нулю."
                  " Попробуйте ещё раз\n")
            continue
        break
    except ValueError:
        print("Введен некорректный рост."
              " В качестве разделителя должна быть точка."
              " Попробуйте ещё раз\n")

# Рассчитываем ИМТ, все переменные в формуле типа int
bmi = user_weight / user_height ** 2

# Рассчитываем необходимый объем воды в мл
water_ml = user_weight * 30

# Переводим объем воды из мл в л
water_l = water_ml / 1000

# Для корректности вывода результата определим сокращение "год/года" или "лет"
# в зависимости от возраста пользователя.
# Вычислим последнюю цифру введенного числа с помощью остатка от деления на 10.
age_abb = "г."
if 11 <= user_age <= 19:
    age_abb = "л."
elif user_age % 10 >= 5 or user_age % 10 == 0:
    age_abb = "л."

# Отступим строку, проведем линию, отступим ещё одну строку
# и выведем итоговый результат.
# Значения ИМТ и объема воды округлим до 1 знака после запятой.
print("\n", "-" * 30, "\n")
print(f"Отчет для пользователя: {user_name} ({user_age} {age_abb})")
print(f"Твой Индекс Массы Тела: {bmi:.1f}")
print(f"Рекомендуемая норма воды: {water_l:.1f} л. в день \n")
print("Расчет окончен. Будьте здоровы!")
