# Зададим минимальные значения для возраста, веса и роста
MIN_AGE = 0
MIN_WEIGHT = 0
MIN_HEIGHT = 0

# Зададим константы нормы воды от веса в день в мл и кол-ва мл в л
WATER_PER_KG = 30
ML_TO_L = 1 / 1000

# Зададим константы для правильного написания "г." или "л."
RULE_TEEN_MIN = 11
RULE_TEEN_MAX = 19
RULE_LAST_DIGIT_LIMIT = 5
RULE_LAST_DIGIT_NULL = 0
RULE_DIVISION_BY = 10

# Запрашиваем у пользователя имя, первую букву имени делаем заглавной
user_name = input("Здравствуйте! На связи умный трекер FitLife."
                  " Как вас зовут? ").strip().capitalize()
# Приветствуем пользователя
print("\n" + user_name + ", рады вас приветствовать!")

# Запрашиваем у пользователя возраст, приводим к типу int.
# Проверяем на корректность вода - отрицательные значения, ноль и текст
while True:
    try:
        user_age = int(input("\nСколько вам лет? "))
        if user_age <= MIN_AGE:
            print("Возраст не может быть отрицательным или равным нулю."
                  " Попробуйте ещё раз\n")
            continue
        break
    except ValueError:
        print("Введен некорректный возраст. Попробуйте ещё раз\n")

# Запрашиваем вес пользователя, приводим к типу float.
# Проверяем на корректность вода - отрицательные значения, ноль и текст
while True:
    try:
        user_weight = float(input("\nКакой у вас вес (кг)? "))
        if user_weight <= MIN_WEIGHT:
            print("Вес не может быть отрицательным или равным нулю."
                  " Попробуйте ещё раз\n")
            continue
        break
    except ValueError:
        print("Введен некорректный вес. Попробуйте ещё раз\n")

# Запрашиваем рост пользователя, приводим к типу float,
# даем подсказку, в каком виде писать.
# Проверяем на корректность вода - отрицательные значения,
# ноль, плавающая точка и текст
while True:
    try:
        user_height = float(input("\nКакой у вас рост (м)? "
                                  "/используете точку в вместо запятой/ "))
        if user_height <= MIN_HEIGHT:
            print("Рост не может быть отрицательным или равным нулю."
                  " Попробуйте ещё раз\n")
            continue
        break
    except ValueError:
        print("Введен некорректный рост."
              " В качестве разделителя должна быть точка."
              " Попробуйте ещё раз\n")

# Рассчитываем ИМТ, все переменные в формуле типа int
bmi = user_weight / user_height ** 2

# Рассчитываем необходимый объем воды в мл
water_ml = user_weight * WATER_PER_KG

# Переводим объем воды из мл в л
water_l = water_ml * ML_TO_L

# Для корректности вывода результата определим сокращение "год/года" или "лет"
# в зависимости от возраста пользователя.
# Вычислим последнюю цифру введенного числа с помощью остатка от деления на 10.
age_abb = "г."
if RULE_TEEN_MIN <= user_age <= RULE_TEEN_MAX:
    age_abb = "л."
elif (
    user_age % RULE_DIVISION_BY >= RULE_LAST_DIGIT_LIMIT
    or user_age % RULE_DIVISION_BY == RULE_LAST_DIGIT_NULL
):
    age_abb = "л."

# Отступим строку, проведем линию, отступим ещё одну строку
# и выведем итоговый результат.
# Значения ИМТ и объема воды округлим до 1 знака после запятой.
print("\n", "-" * 30, "\n")
print(f"Отчет для пользователя: {user_name} ({user_age} {age_abb})")
print(f"Твой Индекс Массы Тела: {bmi:.1f}")
print(f"Рекомендуемая норма воды: {water_l:.1f} л. в день \n")
print("Расчет окончен. Будьте здоровы!")
